
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>第3节：文件恢复原理 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="ch4.html" />
    
    
    <link rel="prev" href="ch2.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    基于不同文件系统下文件删除与恢复的原理分析
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="./">
            
                <a href="./">
            
                    
                    第一章：FAT32文件系统
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.2.1" data-path="ch1.html">
            
                <a href="ch1.html">
            
                    
                    第1节：FAT32文件系统总体结构
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.2" data-path="ch2.html">
            
                <a href="ch2.html">
            
                    
                    第2节：文件删除原理
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.2.3" data-path="ch3.html">
            
                <a href="ch3.html">
            
                    
                    第3节：文件恢复原理
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.4" data-path="ch4.html">
            
                <a href="ch4.html">
            
                    
                    第4节：FAT32文件恢复实验
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="../Chapter2/">
            
                <a href="../Chapter2/">
            
                    
                    第二章：NTFS文件系统
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" data-path="../Chapter2/ch1.html">
            
                <a href="../Chapter2/ch1.html">
            
                    
                    第1节：NTFS文件系统的结构
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.2" data-path="../Chapter2/ch2.html">
            
                <a href="../Chapter2/ch2.html">
            
                    
                    第2节：$Boot文件
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.3" data-path="../Chapter2/ch3.html">
            
                <a href="../Chapter2/ch3.html">
            
                    
                    第3节：$MFT元文件
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.4" data-path="../Chapter2/ch4.html">
            
                <a href="../Chapter2/ch4.html">
            
                    
                    第4节：分析文件记录
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.5" data-path="../Chapter2/ch5.html">
            
                <a href="../Chapter2/ch5.html">
            
                    
                    第5节：NTFS数据恢复
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="../Chapter3/">
            
                <a href="../Chapter3/">
            
                    
                    第三章：EXT3文件系统
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.4.1" data-path="../Chapter3/ch1.html">
            
                <a href="../Chapter3/ch1.html">
            
                    
                    第1节：EXT3文件系统结构
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.2" data-path="../Chapter3/ch2.html">
            
                <a href="../Chapter3/ch2.html">
            
                    
                    第2节：EXT3文件系统存取文件
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.3" data-path="../Chapter3/ch3.html">
            
                <a href="../Chapter3/ch3.html">
            
                    
                    第3节：EXT3文件系统删除文件
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.4" data-path="../Chapter3/ch4.html">
            
                <a href="../Chapter3/ch4.html">
            
                    
                    第4节：EXT3文件系统恢复文件
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.5" data-path="../Chapter3/ch5.html">
            
                <a href="../Chapter3/ch5.html">
            
                    
                    第5节：EXT3文件系统恢复文件实验
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >第3节：文件恢复原理</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x7B2C;3&#x8282;&#xFF1A;&#x6587;&#x4EF6;&#x6062;&#x590D;&#x539F;&#x7406;">&#x7B2C;3&#x8282;&#xFF1A;&#x6587;&#x4EF6;&#x6062;&#x590D;&#x539F;&#x7406;</h1>
<h2 id="31-&#x6587;&#x4EF6;&#x6062;&#x590D;&#x7B80;&#x4ECB;">3.1 &#x6587;&#x4EF6;&#x6062;&#x590D;&#x7B80;&#x4ECB;</h2>
<p>  &#x6839;&#x636E;&#x6587;&#x4EF6;&#x5F7B;&#x5E95;&#x5220;&#x9664;&#x7684;&#x539F;&#x7406;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x77E5;&#x9053;&#x6587;&#x4EF6;&#x7684;&#x6570;&#x636E;&#x5982;&#x679C;&#x672A;&#x88AB;&#x8986;&#x76D6;&#xFF0C;&#x5219;&#x6587;&#x4EF6;&#x7684;&#x6570;&#x636E;&#x8FD8;&#x5B58;&#x5728;&#x4E8E;&#x6570;&#x636E;&#x533A;&#x4E2D;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x8981;&#x60F3;&#x628A;&#x8FD9;&#x4E9B;&#x6570;&#x636E;&#x6062;&#x590D;&#x51FA;&#x6765;&#xFF0E;&#x91CD;&#x5EFA;&#x6211;&#x4EEC;&#x7684;&#x6587;&#x4EF6;&#xFF0C;&#x5219;&#x9700;&#x8981;&#x9996;&#x5148;&#x627E;&#x5230;&#x8FD9;&#x4E9B;&#x6570;&#x636E;&#x7684;&#x5165;&#x53E3;&#x5728;&#x54EA;&#x91CC;&#xFF0C;&#x5373;&#x627E;&#x5230;&#x6570;&#x636E;&#x7684;&#x8D77;&#x59CB;&#x7C07;&#x53F7;&#x3002;</p>
<p>  &#x5982;&#x679C;&#x8BE5;&#x6587;&#x4EF6;&#x7684;&#x8D77;&#x59CB;&#x7C07;&#x53F7;&#x5C0F;&#x4E8E;&#x4E24;&#x4E2A;&#x5B57;&#x8282;&#x6240;&#x80FD;&#x8868;&#x793A;&#x7684;&#x6700;&#x5927;&#x503C;65535&#xFF0C;&#x5219;&#x7528;&#x76EE;&#x5F55;&#x9879;&#x4E2D;&#x504F;&#x79FB;&#x4E3A;1AH-1BH&#x5904;&#x7684;&#x4F4E;&#x4F4D;&#x5B57;&#x5373;&#x53EF;&#x5B58;&#x50A8;&#x8BE5;&#x8D77;&#x59CB;&#x7C07;&#x53F7;&#x503C;&#x3002;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5220;&#x9664;&#x6587;&#x4EF6;&#x65F6;&#xFF0C;&#x5C31;&#x4E0D;&#x5B58;&#x5728;&#x8D77;&#x59CB;&#x7C07;&#x53F7;&#x9AD8;&#x5B57;&#x88AB;&#x6E05;&#x96F6;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x76F4;&#x63A5;&#x4ECE;&#x76EE;&#x5F55;&#x9879;&#x4E2D;&#x504F;&#x79FB;&#x4E3A;1AH-IBH&#x5904;&#x627E;&#x5230;&#x6587;&#x4EF6;&#x6570;&#x636E;&#x7684;&#x8D77;&#x59CB;&#x7C07;&#x53F7;&#x3002;&#x4F46;&#x5982;&#x679C;&#x8D77;&#x59CB;&#x7C07;&#x53F7;&#x8D85;&#x51FA;&#x4E86;&#x4F4E;&#x4F4D;&#x5B57;&#x6240;&#x80FD;&#x8868;&#x793A;&#x7684;&#x6700;&#x5927;&#x503C;&#xFF0C;&#x5219;&#x9700;&#x8981;&#x7528;&#x76EE;&#x5F55;&#x9879;&#x4E2D;&#x504F;&#x79FB;&#x4E3A;14H-15H&#x5904;&#x7684;&#x9AD8;&#x4F4D;&#x5B57;&#x6765;&#x5B58;&#x50A8;&#x5176;&#x503C;&#x3002;&#x8FD9;&#x6837;&#xFF0C;&#x5220;&#x9664;&#x6587;&#x4EF6;&#x65F6;&#xFF0C;&#x8D77;&#x59CB;&#x7C07;&#x53F7;&#x7684;&#x4E24;&#x4E2A;&#x9AD8;&#x5B57;&#x8282;&#x5C31;&#x4F1A;&#x88AB;&#x6E05;&#x96F6;&#xFF0C;&#x4EC5;&#x4FDD;&#x7559;&#x4E86;&#x4E24;&#x4E2A;&#x4F4E;&#x5B57;&#x8282;&#x3002;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x6211;&#x4EEC;&#x8981;&#x60F3;&#x5F97;&#x5230;&#x8D77;&#x59CB;&#x7C07;&#x53F7;&#x7684;&#x4E24;&#x4E2A;&#x9AD8;&#x5B57;&#x8282;&#xFF0C;&#x5C31;&#x9700;&#x8981;&#x53C2;&#x7167;&#x521B;&#x5EFA;&#x65F6;&#x95F4;&#x503C;&#x4E0E;&#x4E4B;&#x63A5;&#x8FD1;&#x7684;&#x5176;&#x4ED6;&#x6B63;&#x5E38;&#x6587;&#x4EF6;&#x7684;&#x8D77;&#x59CB;&#x7C07;&#x53F7;&#x6765;&#x786E;&#x5B9A;&#x4E24;&#x4E2A;&#x9AD8;&#x5B57;&#x8282;&#x3002;&#x5B9E;&#x9645;&#x8FDB;&#x884C;&#x6062;&#x590D;&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x6839;&#x636E;&#x8BE5;&#x6587;&#x4EF6;&#x76EE;&#x5F55;&#x9879;&#x524D;&#x540E;&#x7684;&#x6B63;&#x5E38;&#x6587;&#x4EF6;&#x7684;&#x76EE;&#x5F55;&#x9879;&#x4E2D;&#x7684;&#x504F;&#x79FB;&#x4E3A;14H-15H&#x5904;&#x7684;&#x503C;&#x6765;&#x5224;&#x65AD;&#x8D77;&#x59CB;&#x7C07;&#x53F7;&#x7684;&#x4E24;&#x4E2A;&#x9AD8;&#x5B57;&#x8282;&#x503C;&#x3002;</p>
<p>  &#x5176;&#x6B21;&#xFF0C;&#x6211;&#x4EEC;&#x8FD8;&#x9700;&#x8981;&#x77E5;&#x9053;&#x6587;&#x4EF6;&#x6570;&#x636E;&#x5B58;&#x653E;&#x5728;&#x5176;&#x4F59;&#x54EA;&#x4E9B;&#x7C07;&#x4E0A;&#x3002;&#x5728;&#x6B64;&#x4E4B;&#x524D;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x5148;&#x4E86;&#x89E3;&#x4E00;&#x4E0B;Windows&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x7684;&#x7C07;&#x7684;&#x5206;&#x914D;&#x7B56;&#x7565;&#x3002;Windows&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x5BF9;&#x6587;&#x4EF6;&#x5206;&#x914D;&#x7C07;&#x65F6;&#xFF0C;&#x91C7;&#x7528;&#x4E0B;&#x4E00;&#x53EF;&#x7528;&#x5206;&#x914D;&#x7B56;&#x7565;&#x3002;&#x5373;&#x4E3A;&#x4E00;&#x4E2A;&#x6587;&#x4EF6;&#x5206;&#x914D;&#x4E86;&#x4E00;&#x4E2A;&#x7C07;&#x540E;&#xFF0C;&#x76F4;&#x63A5;&#x7531;&#x6B64;&#x7C07;&#x4F4D;&#x7F6E;&#x5411;&#x540E;&#x641C;&#x7D22;&#x4E0B;&#x4E00;&#x4E2A;&#x53EF;&#x7528;&#x7C07;&#xFF0C;&#x7EE7;&#x7EED;&#x4E3A;&#x5176;&#x5206;&#x914D;&#xFF0C;&#x800C;&#x4E0D;&#x4F1A;&#x4ECE;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x7684;&#x5F00;&#x59CB;&#x5904;&#x8FDB;&#x884C;&#x91CD;&#x65B0;&#x641C;&#x7D22;&#x3002;&#x57FA;&#x4E8E;&#x8FD9;&#x4E2A;&#x5206;&#x914D;&#x7B56;&#x7565;&#xFF0C;&#x4E00;&#x4E2A;&#x6587;&#x4EF6;&#x7684;&#x6570;&#x636E;&#x5B58;&#x50A8;&#x6709;&#x4E09;&#x79CD;&#x53EF;&#x80FD;&#x7684;&#x60C5;&#x51B5;&#xFF1A;</p>
<p><img src="../IMG/1.3.1.png" alt="1.3.1"></p>
<p>  &#x56FE;2&#x4E2D;&#x663E;&#x793A;&#x4E86;&#x4E09;&#x79CD;&#x4E0D;&#x540C;&#x7684;&#x6587;&#x4EF6;&#x6570;&#x636E;&#x5B58;&#x50A8;&#x60C5;&#x51B5;&#x3002;&#x6DE1;&#x7070;&#x8272;&#x65B9;&#x6846;&#x8868;&#x793A;&#x5206;&#x914D;&#x7ED9;&#x8FD9;&#x4E2A;&#x6587;&#x4EF6;&#x4F7F;&#x7528;&#x7684;&#x7C07;&#xFF0C;&#x6DF1;&#x7070;&#x8272;&#x65B9;&#x6846;&#x8868;&#x793A;&#x5206;&#x914D;&#x7ED9;&#x5176;&#x4ED6;&#x6587;&#x4EF6;&#x4F7F;&#x7528;&#x7684;&#x7C07;&#xFF0C;&#x767D;&#x8272;&#x65B9;&#x6846;&#x8868;&#x793A;&#x672A;&#x5206;&#x914D;&#x7684;&#x7A7A;&#x7C07;&#x3002;A&#x56FE;&#x8868;&#x793A;&#x8FD9;&#x4E2A;&#x6587;&#x4EF6;&#x6570;&#x636E;&#x53EA;&#x5360;&#x7528;&#x4E86;&#x4E00;&#x4E2A;&#x7C07;&#x3002;B&#x56FE;&#x8868;&#x793A;&#x8FD9;&#x4E2A;&#x6587;&#x4EF6;&#x5360;&#x7528;&#x4E86;4&#x4E2A;&#x7C07;&#xFF0C;&#x7C07;&#x53F7;&#x4E3A;5&#x3001;6&#x3001;7&#x3001;8&#xFF0C;&#x800C;&#x4E14;&#x7CFB;&#x7EDF;&#x7ED9;&#x8FD9;&#x4E2A;&#x6587;&#x4EF6;&#x5206;&#x914D;&#x7684;&#x8FD9;&#x56DB;&#x4E2A;&#x7C07;&#x662F;&#x8FDE;&#x7EED;&#x7684;&#x3002;c&#x56FE;&#x8868;&#x793A;&#x8FD9;&#x4E2A;&#x6587;&#x4EF6;&#x6570;&#x636E;&#x5360;&#x7528;&#x4E86;4&#x4E2A;&#x7C07;&#xFF0C;&#x7C07;&#x53F7;&#x4E3A;5&#x3001;7&#x3001;8&#x3001;10&#xFF0C;&#x4F46;&#x7CFB;&#x7EDF;&#x7ED9;&#x8FD9;&#x4E2A;&#x6587;&#x4EF6;&#x5206;&#x914D;&#x7684;&#x8FD9;&#x56DB;&#x4E2A;&#x7C07;&#x662F;&#x975E;&#x8FDE;&#x7EED;&#x7684;&#x3002;</p>
<p>  &#x5BF9;&#x4E8E;A&#x56FE;&#x6240;&#x793A;&#x60C5;&#x51B5;&#xFF0C;&#x6062;&#x590D;&#x65F6;&#xFF0C;&#x53EA;&#x9700;&#x5728;&#x786E;&#x5B9A;&#x8D77;&#x59CB;&#x7C07;&#x53F7;&#x540E;&#xFF0C;&#x5BF9;&#x8D77;&#x59CB;&#x7C07;&#x4E2D;&#x7684;&#x76F8;&#x5E94;&#x6587;&#x4EF6;&#x5927;&#x5C0F;&#x7684;&#x6570;&#x636E;&#x8FDB;&#x884C;&#x63D0;&#x53D6;&#x5373;&#x53EF;&#x6062;&#x590D;&#x6587;&#x4EF6;&#x3002;&#x5BF9;&#x4E8E;B&#x56FE;&#x60C5;&#x51B5;&#xFF0C;&#x6062;&#x590D;&#x65F6;&#xFF0C;&#x5728;&#x786E;&#x5B9A;&#x8D77;&#x59CB;&#x7C07;&#x53F7;&#x540E;&#xFF0C;&#x4ECE;&#x8D77;&#x59CB;&#x7C07;&#x5F00;&#x59CB;&#xFF0C;&#x4E00;&#x76F4;&#x5411;&#x540E;&#x63D0;&#x53D6;&#x6570;&#x636E;&#xFF0C;&#x76F4;&#x5230;&#x63D0;&#x53D6;&#x51FA;&#x7684;&#x6570;&#x636E;&#x5927;&#x5C0F;&#x7B49;&#x4E8E;&#x6587;&#x4EF6;&#x5927;&#x5C0F;&#x65F6;&#x4E3A;&#x6B62;&#xFF0C;&#x8FD9;&#x6837;&#x5C31;&#x6062;&#x590D;&#x51FA;&#x4E86;&#x539F;&#x6587;&#x4EF6;&#x7684;&#x6570;&#x636E;&#x3002;</p>
<p>  &#x5BF9;&#x4E8E;C&#x56FE;&#x60C5;&#x51B5;&#xFF0C;&#x8BE5;&#x6587;&#x4EF6;&#x6570;&#x636E;&#x662F;&#x975E;&#x8FDE;&#x7EED;&#x5B58;&#x653E;&#x7684;&#x3002;&#x5220;&#x9664;&#x6587;&#x4EF6;&#x540E;&#xFF0C;&#x7C07;5&#x3001;7&#x3001;8&#x3001;10&#x6240;&#x5BF9;&#x5E94;&#x7684;FAT&#x8868;&#x9879;&#x503C;&#x4E3A;&#x201C;00000000H&#x201D;&#x3002;&#x6B64;&#x65F6;&#xFF0C;&#x5982;&#x679C;&#x7C07;6,9&#x6240;&#x5BF9;&#x5E94;&#x7684;&#x6587;&#x4EF6;&#x672A;&#x88AB;&#x5220;&#x9664;&#xFF0C;&#x5219;6,9&#x6240;&#x5BF9;&#x5E94;&#x7684;FAT&#x8868;&#x9879;&#x503C;&#x4E3A;&#x6709;&#x6548;&#x503C;00000001H&#xFF5E; 0FFFFFFFH&#x3002;&#x8FD9;&#x6837;&#xFF0C;&#x6062;&#x590D;&#x65F6;&#xFF0C;&#x5148;&#x7531;&#x76EE;&#x5F55;&#x9879;&#x4E2D;&#x7684;&#x6587;&#x4EF6;&#x5927;&#x5C0F;&#x8BA1;&#x7B97;&#x51FA;&#x6240;&#x5BF9;&#x5E94;&#x7684;&#x7C07;&#x6570;&#x3002;&#x5728;&#x786E;&#x5B9A;&#x8D77;&#x59CB;&#x7C07;&#x53F7;&#x540E;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x4ECE;&#x8D77;&#x59CB;&#x7C07;&#x53F7;&#x5BF9;&#x5E94;&#x7684;FAT&#x8868;&#x9879;&#x5F00;&#x59CB;&#x5411;&#x540E;&#x641C;&#x7D22;&#xFF0C;&#x8BB0;&#x5F55;&#x4E0B;FAT&#x8868;&#x9879;&#x503C;&#x4E3A;&#x201C;00000000H&#x201D;&#x7684;&#x6240;&#x5BF9;&#x5E94;&#x7684;&#x7C07;&#x53F7;&#x3002;&#x5F53;&#x8BB0;&#x5F55;&#x4E0B;&#x7684;&#x7C07;&#x53F7;&#x6570;&#x7B49;&#x4E8E;&#x6587;&#x4EF6;&#x5927;&#x5C0F;&#x6240;&#x5BF9;&#x5E94;&#x7684;&#x7C07;&#x6570;&#x65F6;&#xFF0C;&#x505C;&#x6B62;&#x641C;&#x7D22;&#x3002;&#x7136;&#x540E;&#x6839;&#x636E;&#x8BB0;&#x5F55;&#x4E0B;&#x7684;&#x7C07;&#x53F7;&#xFF0C;&#x63D0;&#x53D6;&#x51FA;&#x5BF9;&#x5E94;&#x7C07;&#x4E2D;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x76F4;&#x5230;&#x63D0;&#x53D6;&#x51FA;&#x7684;&#x6570;&#x636E;&#x5927;&#x5C0F;&#x7B49;&#x4E8E;&#x6587;&#x4EF6;&#x5927;&#x5C0F;&#x65F6;&#x4E3A;&#x6B62;&#xFF0C;&#x8FD9;&#x6837;&#x5C31;&#x6062;&#x590D;&#x51FA;&#x4E86;&#x539F;&#x6587;&#x4EF6;&#x7684;&#x6570;&#x636E;&#x3002;</p>
<p>  &#x6839;&#x636E;B&#x56FE;&#x548C;c&#x56FE;&#x60C5;&#x51B5;&#x4E0B;&#x7684;&#x6570;&#x636E;&#x6062;&#x590D;&#x539F;&#x7406;&#xFF0C;&#x63D0;&#x51FA;&#x4EE5;&#x4E0B;&#x57FA;&#x4E8E;&#x6570;&#x636E;&#x7C07;&#x8FDE;&#x7EED;&#x5206;&#x914D;&#x7684;&#x6587;&#x4EF6;&#x6062;&#x590D;&#x7B97;&#x6CD5;&#x548C;&#x57FA;&#x4E8E;&#x6570;&#x636E;&#x7C07;&#x975E;&#x8FDE;&#x7EED;&#x5206;&#x914D;&#x7684;&#x6587;&#x4EF6;&#x6062;&#x590D;&#x7B97;&#x6CD5;&#x3002;</p>
<h2 id="32-&#x57FA;&#x4E8E;&#x6570;&#x636E;&#x7C07;&#x8FDE;&#x7EED;&#x5206;&#x914D;&#x7684;&#x6587;&#x4EF6;&#x6062;&#x590D;&#x7B97;&#x6CD5;">3.2 &#x57FA;&#x4E8E;&#x6570;&#x636E;&#x7C07;&#x8FDE;&#x7EED;&#x5206;&#x914D;&#x7684;&#x6587;&#x4EF6;&#x6062;&#x590D;&#x7B97;&#x6CD5;</h2>
<p>&#x7B97;&#x6CD5;&#x6B65;&#x9AA4;&#x5982;&#x4E0B;&#xFF1A; </p>
<ul>
<li>(1)&#x786E;&#x5B9A;&#x88AB;&#x5220;&#x9664;&#x6587;&#x4EF6;&#x6240;&#x5728;&#x5206;&#x533A;&#x7684;&#x5F15;&#x5BFC;&#x6247;&#x533A;&#x7684;&#x4F4D;&#x7F6E;&#x3002;&#x53EF;&#x4EE5;&#x7531;&#x4E3B;&#x5F15;&#x5BFC;&#x6247;&#x533A;&#x4E2D;&#x7684;&#x5206;&#x533A;&#x8868;&#x786E;&#x5B9A;&#x3002;</li>
<li>(2)&#x4ECE;&#x5F15;&#x5BFC;&#x6247;&#x533A;&#x4E2D;&#x8BFB;&#x53D6;&#x201C;&#x6BCF;&#x6247;&#x533A;&#x5B57;&#x8282;&#x6570;&#x201D;&#x3001;&#x201C;&#x6BCF;&#x7C07;&#x6247;&#x533A;&#x6570;&#x201D;&#x3001;&#x201C;&#x4FDD;&#x7559;&#x6247;&#x533A;&#x6570;&#x201D;&#x3001;&#x201C;FAT&#x4E2A;&#x6570;&#x201D;&#x548C;&#x201C;&#x6BCF;&#x4E2A;FAT&#x6240;&#x5360;&#x6247;&#x533A;&#x6570;&#x201D;&#x7684;&#x53C2;&#x6570;&#x503C;&#x3002;&#x5E76;&#x8BA1;&#x7B97;&#x6839;&#x76EE;&#x5F55;&#x76F8;&#x5BF9;&#x4E8E;&#x5F15;&#x5BFC;&#x6247;&#x533A;&#x7684;&#x8D77;&#x59CB;&#x4F4D;&#x7F6E;(&#x4ECE;0&#x5F00;&#x59CB;)&#x3002;&#x6839;&#x76EE;&#x5F55;&#x76F8;&#x5BF9;&#x8D77;&#x59CB;&#x4F4D;&#x7F6E; = &#x4FDD;&#x7559;&#x6247;&#x533A;&#x6570; + FAT&#x4E2A;&#x6570; * &#x6BCF;&#x4E2A;FAT&#x6240;&#x5360;&#x6247;&#x533A;&#x6570;&#x3002;</li>
<li>(3)&#x6839;&#x636E;&#x88AB;&#x5220;&#x9664;&#x6587;&#x4EF6;&#x7684;&#x6587;&#x4EF6;&#x8DEF;&#x5F84;&#xFF0C;&#x4ECE;&#x6839;&#x76EE;&#x5F55;&#x5F00;&#x59CB;&#x9010;&#x5C42;&#x5F80;&#x4E0B;&#x904D;&#x5386;&#x627E;&#x5230;&#x8BE5;&#x6587;&#x4EF6;&#x6240;&#x5728;&#x76EE;&#x5F55;&#x7684;&#x76EE;&#x5F55;&#x9879;&#x96C6;&#x5408;&#xFF0C;&#x5E76;&#x904D;&#x5386;&#x8BE5;&#x76EE;&#x5F55;&#x9879;&#x96C6;&#x5408;&#xFF0C;&#x627E;&#x5230;&#x6587;&#x4EF6;&#x540D;&#x4E0E;&#x88AB;&#x5220;&#x9664;&#x6587;&#x4EF6;&#x7684;&#x6587;&#x4EF6;&#x540D;&#x90E8;&#x5206;&#x5339;&#x914D;&#xFF0C;&#x4E14;&#x540E;&#x7F00;&#x540D;&#x4E00;&#x81F4;&#x7684;&#x76EE;&#x5F55;&#x9879;&#x3002;</li>
<li>(4)&#x4ECE;&#x627E;&#x5230;&#x7684;&#x76EE;&#x5F55;&#x9879;&#x4E2D;&#x8BFB;&#x53D6;&#x504F;&#x79FB;&#x4E3A;1AH-1BH&#x7684;&#x4E24;&#x4E2A;&#x5B57;&#x8282;&#xFF0C;&#x786E;&#x5B9A;&#x8D77;&#x59CB;&#x7C07;&#x53F7;&#x7684;&#x4F4E;&#x4F4D;&#x5B57;&#x3002;&#x8BFB;&#x53D6;&#x504F;&#x79FB;&#x4E3A;ICH-1FH&#x7684;&#x56DB;&#x4E2A;&#x5B57;&#x8282;&#xFF0C;&#x786E;&#x5B9A;&#x6587;&#x4EF6;&#x6570;&#x636E;&#x7684;&#x5927;&#x5C0F;&#x3002;</li>
<li>(5)&#x904D;&#x5386;&#x8BE5;&#x76EE;&#x5F55;&#x9879;&#x96C6;&#x5408;&#x7684;&#x6240;&#x6709;&#x6B63;&#x5E38;&#x6587;&#x4EF6;&#x7684;&#x76EE;&#x5F55;&#x9879;&#xFF0C;&#x8BB0;&#x5F55;&#x6BCF;&#x4E2A;&#x76EE;&#x5F55;&#x9879;&#x4E2D;&#x504F;&#x79FB;&#x4E3A;14H-15H&#x5904;&#x7684;&#x503C;&#xFF0C;&#x5E76;&#x627E;&#x51FA;&#x51FA;&#x73B0;&#x9891;&#x6B21;&#x6700;&#x9AD8;&#x7684;&#x503C;&#xFF0C;&#x628A;&#x8BE5;&#x503C;&#x4F5C;&#x4E3A;&#x8D77;&#x59CB;&#x7C07;&#x53F7;&#x7684;&#x9AD8;&#x4F4D;&#x5B57;&#x3002;</li>
<li>(6)&#x6839;&#x636E;&#x786E;&#x5B9A;&#x7684;&#x8D77;&#x59CB;&#x7C07;&#x53F7;&#x548C;&#x6587;&#x4EF6;&#x5927;&#x5C0F;&#xFF0C;&#x627E;&#x5230;&#x6587;&#x4EF6;&#x6570;&#x636E;&#x7684;&#x8D77;&#x59CB;&#x7C07;&#xFF0C;&#x5E76;&#x8BFB;&#x53D6;&#x6570;&#x636E;&#xFF0C;&#x76F4;&#x5230;&#x6240;&#x8BFB;&#x53D6;&#x6570;&#x636E;&#x5927;&#x5C0F;&#x7B49;&#x4E8E;&#x6587;&#x4EF6;&#x5927;&#x5C0F;&#x65F6;&#x4E3A;&#x6B62;&#x3002;</li>
<li>(7)&#x4FDD;&#x5B58;&#x6570;&#x636E;&#xFF0C;&#x5E76;&#x91CD;&#x547D;&#x540D;&#x6587;&#x4EF6;&#x3002;</li>
<li>(8)&#x5982;&#x679C;&#x5F97;&#x5230;&#x7684;&#x6587;&#x4EF6;&#x4E0D;&#x662F;&#x6211;&#x4EEC;&#x60F3;&#x8981;&#x7684;&#x539F;&#x6587;&#x4EF6;&#xFF0C;&#x5219;&#x9700;&#x4ECE;(5)&#x4E2D;&#x8BB0;&#x5F55;&#x7684;&#x8D77;&#x59CB;&#x7C07;&#x53F7;&#x9AD8;&#x4F4D;&#x5B57;&#x7684;&#x96C6;&#x5408;&#x4E2D;&#x9009;&#x62E9;&#x53E6;&#x4E00;&#x4E2A;&#x51FA;&#x73B0;&#x9891;&#x6B21;&#x8F83;&#x9AD8;&#x7684;&#x503C;&#x4F5C;&#x4E3A;&#x8BE5;&#x6587;&#x4EF6;&#x8D77;&#x59CB;&#x7C07;&#x53F7;&#x7684;&#x9AD8;&#x4F4D;&#x5B57;&#xFF0C;&#x91CD;&#x590D;&#x6B65;&#x9AA4;(6)(7)&#xFF0C;&#x76F4;&#x5230;&#x6062;&#x590D;&#x51FA;&#x539F;&#x6587;&#x4EF6;&#x6216;&#x904D;&#x5386;&#x5B8C;&#x9AD8;&#x4F4D;&#x5B57;&#x96C6;&#x5408;&#x4E3A;&#x6B62;&#x3002;&#x5982;&#x679C;&#x904D;&#x5386;&#x5B8C;(5)&#x4E2D;&#x7684;&#x9AD8;&#x4F4D;&#x5B57;&#x96C6;&#x5408;&#x8FD8;&#x672A;&#x6062;&#x590D;&#x51FA;&#x539F;&#x6587;&#x4EF6;&#xFF0C;&#x5219;&#x9700;&#x904D;&#x5386;0000H-FFFFH&#x7684;&#x503C;&#x5E76;&#x4F5C;&#x4E3A;&#x8BE5;&#x6587;&#x4EF6;&#x8D77;&#x59CB;&#x7C07;&#x53F7;&#x7684;&#x9AD8;&#x4F4D;&#x5B57;&#xFF0C;&#x91CD;&#x590D;&#x6B65;&#x9AA4;(6)(7)&#xFF0C;&#x76F4;&#x5230;&#x6062;&#x590D;&#x51FA;&#x539F;&#x6587;&#x4EF6;&#x6216;&#x904D;&#x5386;&#x7ED3;&#x675F;&#x4E3A;&#x6B62;&#x3002;</li>
</ul>
<h2 id="33-&#x57FA;&#x4E8E;&#x6570;&#x636E;&#x7C07;&#x975E;&#x8FDE;&#x7EED;&#x5206;&#x914D;&#x7684;&#x6587;&#x4EF6;&#x6062;&#x590D;&#x7B97;&#x6CD5;">3.3 &#x57FA;&#x4E8E;&#x6570;&#x636E;&#x7C07;&#x975E;&#x8FDE;&#x7EED;&#x5206;&#x914D;&#x7684;&#x6587;&#x4EF6;&#x6062;&#x590D;&#x7B97;&#x6CD5;</h2>
<p>&#x7B97;&#x6CD5;&#x6B65;&#x9AA4;&#x5982;&#x4E0B;&#xFF1A;</p>
<ul>
<li>(1)-(5)&#x540C;3.2&#x4E2D;&#x7684;&#x6B65;&#x9AA4;(1)-(5)&#x3002;</li>
<li>(6)&#x7531;&#x6587;&#x4EF6;&#x6570;&#x636E;&#x5360;&#x7528;&#x7C07;&#x6570;N=&#x6587;&#x4EF6;&#x6570;&#x636E;&#x5927;&#x5C0F;/(&#x6BCF;&#x7C07;&#x6247;&#x533A;&#x6570;&#xD7;&#x6BCF;&#x6247;&#x533A;&#x5B57;&#x8282;&#x6570;)&#xFF0C;&#x8BA1;&#x7B97;&#x51FA;&#x6587;&#x4EF6;&#x6570;&#x636E;&#x5360;&#x7528;&#x7C07;&#x6570;N&#x3002;</li>
<li>(7)&#x6839;&#x636E;(5)&#x4E2D;&#x786E;&#x5B9A;&#x7684;&#x8D77;&#x59CB;&#x7C07;&#x53F7;&#xFF0C;&#x7531;FAT&#x8868;&#x9879;&#x504F;&#x79FB;&#x91CF; = &#x7C07;&#x53F7;&#xD7;4&#xFF0C;&#x786E;&#x5B9A;&#x8D77;&#x59CB;&#x7C07;&#x53F7;&#x5BF9;&#x5E94;&#x7684;FAT&#x8868;&#x9879;&#x3002;</li>
<li>(8)&#x5BF9;&#x8D77;&#x59CB;&#x7C07;&#x53F7;&#x5BF9;&#x5E94;&#x7684;FAT&#x8868;&#x9879;&#x53CA;&#x5176;&#x540E;&#x9762;&#x7684;&#x6BCF;&#x4E00;&#x4E2A;&#x8868;&#x9879;&#x8FDB;&#x884C;&#x5982;&#x4E0B;&#x5224;&#x65AD;&#xFF1A;&#x82E5;&#x8868;&#x9879;&#x503C;&#x4E3A;00000000H&#xFF0C;&#x5219;&#x7531;&#x7C07;&#x53F7;=FAT&#x8868;&#x9879;&#x504F;&#x79FB;&#x91CF;/4&#xFF0C;&#x8BA1;&#x7B97;&#x5E76;&#x8BB0;&#x5F55;&#x8BE5;FAT&#x8868;&#x9879;&#x5BF9;&#x5E94;&#x7684;&#x7C07;&#x53F7;&#xFF0C;&#x5426;&#x5219;&#x8DF3;&#x8FC7;&#x8BE5;&#x8868;&#x9879;&#xFF0C;&#x7EE7;&#x7EED;&#x8FDB;&#x884C;&#x4E0B;&#x4E00;&#x4E2A;FAT&#x8868;&#x9879;&#x7684;&#x5224;&#x65AD;&#x3002;&#x76F4;&#x5230;&#x8BB0;&#x5F55;&#x7684;&#x7C07;&#x53F7;&#x6570;&#x4E3A;N&#x65F6;&#x505C;&#x6B62;&#x3002;</li>
<li>(9)&#x904D;&#x5386;(8)&#x4E2D;&#x5DF2;&#x7ECF;&#x8BB0;&#x5F55;&#x4E0B;&#x7684;&#x7C07;&#x53F7;&#xFF0C;&#x8BFB;&#x53D6;&#x6BCF;&#x4E2A;&#x7C07;&#x53F7;&#x76F8;&#x5E94;&#x7C07;&#x4E2D;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x76F4;&#x5230;&#x6240;&#x8BFB;&#x53D6;&#x6570;&#x636E;&#x603B;&#x5927;&#x5C0F;&#x7B49;&#x4E8E;&#x6587;&#x4EF6;&#x5927;&#x5C0F;&#x65F6;&#x4E3A;&#x6B62;&#x3002; </li>
<li>(10)&#x4FDD;&#x5B58;&#x6570;&#x636E;&#xFF0C;&#x91CD;&#x547D;&#x540D;&#x6587;&#x4EF6;&#x3002;</li>
<li>(11)&#x5982;&#x679C;&#x5F97;&#x5230;&#x7684;&#x6587;&#x4EF6;&#x4E0D;&#x662F;&#x6211;&#x4EEC;&#x60F3;&#x8981;&#x7684;&#x539F;&#x6587;&#x4EF6;&#xFF0C;&#x5219;&#x9700;&#x4ECE;(5)&#x4E2D;&#x8BB0;&#x5F55;&#x7684;&#x8D77; &#x59CB;&#x7C07;&#x53F7;&#x9AD8;&#x4F4D;&#x5B57;&#x7684;&#x96C6;&#x5408;&#x4E2D;&#x9009;&#x62E9;&#x53E6;&#x4E00;&#x4E2A;&#x51FA;&#x89C2;&#x9891;&#x6B21;&#x8F83;&#x9AD8;&#x7684;&#x503C;&#x4F5C;&#x4E3A;&#x8BE5;&#x6587;&#x4EF6;&#x8D77;&#x59CB;&#x7C07;&#x53F7;&#x7684;&#x9AD8;&#x4F4D;&#x5B57;&#xFF0C;&#x91CD;&#x590D;&#x6B65;&#x9AA4;(6)(7)(8)(9)(10)&#xFF0C;&#x76F4;&#x5230;&#x6062;&#x590D;&#x51FA;&#x539F;&#x6587;&#x4EF6;&#x6216;&#x904D;&#x5386;&#x5B8C;&#x9AD8;&#x4F4D;&#x5B57;&#x96C6;&#x5408;&#x4E3A;&#x6B62;&#x3002;&#x5982;&#x679C;&#x904D;&#x5386;&#x5B8C;(5)&#x4E2D;&#x7684;&#x9AD8;&#x4F4D;&#x5B57;&#x96C6;&#x5408;&#x8FD8;&#x672A;&#x6062;&#x590D;&#x51FA;&#x539F;&#x6587;&#x4EF6;&#xFF0C;&#x5219;&#x9700;&#x904D;&#x5386;0000H-FFFFH&#x7684;&#x503C;&#x5E76;&#x4F5C;&#x4E3A;&#x8BE5;&#x6587;&#x4EF6;&#x8D77;&#x59CB;&#x7C07;&#x53F7;&#x7684;&#x9AD8;&#x4F4D;&#x5B57;&#xFF0C;&#x91CD;&#x590D;&#x6B65;&#x9AA4;(6)(7)(8)(9)&#x76F4;&#x5230;&#x6062;&#x590D;&#x51FA;&#x539F;&#x6587;&#x4EF6;&#x6216;&#x904D;&#x5386;&#x7ED3;&#x675F;&#x4E3A;&#x6B62;&#x3002;</li>
</ul>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="ch2.html" class="navigation navigation-prev " aria-label="Previous page: 第2节：文件删除原理">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="ch4.html" class="navigation navigation-next " aria-label="Next page: 第4节：FAT32文件恢复实验">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"第3节：文件恢复原理","level":"1.2.3","depth":2,"next":{"title":"第4节：FAT32文件恢复实验","level":"1.2.4","depth":2,"path":"Chapter1/ch4.md","ref":"Chapter1/ch4.md","articles":[]},"previous":{"title":"第2节：文件删除原理","level":"1.2.2","depth":2,"path":"Chapter1/ch2.md","ref":"Chapter1/ch2.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":["livereload"],"pluginsConfig":{"livereload":{},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"Chapter1/ch3.md","mtime":"2019-06-19T08:15:41.472Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2019-06-19T08:55:11.487Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

